#include <iostream>
using namespace std;
int main() {

	//int x, y;
	//cout << "Enter value x:";
	//cin >> x;
	//if (x < 3) {
	//	y = x * 2;
	//}
	//else if (x < 10) {
	//	y = x*x + 3;
	//}
	//else {
	//	y = x / 3;
	//}
	//cout << "Total " << y << endl;
	//double  N, Power, k;
	//cout << "Enter power your car:";
	//cin >> Power;
	//if (Power <= 100) {
	//	k = 1.5;
	//}
	//else if (Power <= 150) {
	//	k = 2.1;
	//}
	//else if (Power <= 200) {
	//	k = 3.5;
	//}
	//else {
	//	k = 5.8;
	//}
	//N = Power*k;
	//cout << "Tax: " << N << endl;
	//int a, b, c, d;
	//cout << "Enter four values:";
	//cin >> a >> b >> c >> d;
	//int Z = a;
	//if (Z < b)
	//	Z = b;
	//if (Z < c)
	//	Z = c;
	//if (Z < d)
	//	Z = d;
	//cout << "Your max value " << Z << endl;
	//const double S = 73.5,E=91.65;
	//double rubles;
	//char Cash;
	//setlocale(LC_ALL, "rus");
	//cout << "Введите сумму рублей для обмена:";
	//cin >> rubles;
	//cout << "Для конвертации в доллары введите S\n"
	//	"Для ковертации в евро - E\n";
	//cin >> Cash;
	//if (Cash == 'S' || Cash =='s') {
	//	cout << "В долларах это -" << rubles/S
	//		<< endl;
	//}
	//else if (Cash == 'E' || Cash == 'e') {
	//	cout << "В евро это -" << rubles/E<< endl;
	//}
	//else {
	//	cout << " Неверно выбрана валюта\n";
	//}

	//Создать программу конвертации из сантиметров в
	//дюймы и обратно.
	//Пользователь вводит длину и указывает в какую 
	//величину переводить
	//1 дюйм = 2.54 см
	//int value;
	//cout << "Enter value:";
	//cin >> value;
	//value % 2 ? (cout << "odd") : (cout << "even");

	//int a, b, c;
	//cin >> a >> b >> c;
	//int Z = a > b ? a : b;
	//Z = Z > c ? Z : c;

	//int x = 1, y = 0;
	//if (y && ++x)
	//	cout << "yes";
	//else
	//	cout << x << ":";
	//if (x || --y)
	//	cout << y<<":";
	//else
	//	cout << x << ":";
	//1. Пользователь вводит число от 1000 до 9999
	// определить сумму цифр/разрядов числа.
	//2.пользователь вводит координаты точки (х и у)
	//определить в какой она четверти
	//3. Пользователь вводит скорость автомобиля
	// Бак автомобиля 40 л
	//Расход топлива при скорости <50 - 7.3 л/100км
	//при скорости 50<= и < 80 - 8.3 л/100км
	//при скорости >=80 и <100 - 7.9
	//>=100 -9.7
	//Пользователь так же определять расстояние до
	//цели, сколько полных баков потребуется для 
	//поездки
}